; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	image3 - mode
	image1 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation4 - direction
	Star1 - direction
	GroundStation5 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
	(supports instrument2 spectrograph0)
	(supports instrument2 image1)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
)
(:goal (and
	(pointing satellite1 Planet15)
	(have_image Phenomenon10 image1)
	(have_image Planet11 infrared2)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 image1)
	(have_image Planet14 spectrograph0)
	(have_image Planet15 image3)
	(have_image Star16 image3)
))

)

; plan
1. (turn_to satellite2 groundstation5 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 8
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite2 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite2 phenomenon10 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 phenomenon10)
   goals met: 0 of 8
5. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 1 of 8
6. (turn_to satellite0 groundstation4 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 8
7. (take_image satellite2 phenomenon10 instrument2 image1)
   added: (have_image phenomenon10 image1)
   goals met: 2 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
9. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 8
10. (turn_to satellite0 planet11 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet11)
   goals met: 2 of 8
11. (take_image satellite0 planet11 instrument0 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 3 of 8
12. (turn_to satellite0 planet15 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet15)
   goals met: 3 of 8
13. (take_image satellite0 planet15 instrument0 image3)
   added: (have_image planet15 image3)
   goals met: 4 of 8
14. (turn_to satellite0 star16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star16)
   goals met: 4 of 8
15. (take_image satellite0 star16 instrument0 image3)
   added: (have_image star16 image3)
   goals met: 5 of 8
16. (turn_to satellite2 phenomenon12 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon12)
   goals met: 5 of 8
17. (take_image satellite2 phenomenon12 instrument2 image1)
   added: (have_image phenomenon12 image1)
   goals met: 6 of 8
18. (turn_to satellite2 phenomenon13 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon13)
   goals met: 6 of 8
19. (take_image satellite2 phenomenon13 instrument2 image1)
   added: (have_image phenomenon13 image1)
   goals met: 7 of 8
20. (turn_to satellite2 planet14 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet14)
   goals met: 7 of 8
21. (take_image satellite2 planet14 instrument2 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 8 of 8
